load_test/results/20260420_194844/stress_vus50.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: async_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * stress: 50 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 50 VUs  0m01.0s/3m0s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 50 VUs  0m02.0s/3m0s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 50 VUs  0m03.0s/3m0s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 50 VUs  0m04.0s/3m0s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 50 VUs  0m05.0s/3m0s

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 50 VUs  0m06.0s/3m0s

running (0m07.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 50 VUs  0m07.0s/3m0s

running (0m08.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 50 VUs  0m08.0s/3m0s

running (0m09.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   5% ] 50 VUs  0m09.0s/3m0s

running (0m10.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   6% ] 50 VUs  0m10.0s/3m0s

running (0m11.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   6% ] 50 VUs  0m11.0s/3m0s

running (0m12.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   7% ] 50 VUs  0m12.0s/3m0s

running (0m13.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   7% ] 50 VUs  0m13.0s/3m0s

running (0m14.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   8% ] 50 VUs  0m14.0s/3m0s

running (0m15.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   8% ] 50 VUs  0m15.0s/3m0s

running (0m16.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   9% ] 50 VUs  0m16.0s/3m0s

running (0m17.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [   9% ] 50 VUs  0m17.0s/3m0s

running (0m18.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  10% ] 50 VUs  0m18.0s/3m0s

running (0m19.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  11% ] 50 VUs  0m19.0s/3m0s

running (0m20.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  11% ] 50 VUs  0m20.0s/3m0s

running (0m21.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  12% ] 50 VUs  0m21.0s/3m0s

running (0m22.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  12% ] 50 VUs  0m22.0s/3m0s

running (0m23.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  13% ] 50 VUs  0m23.0s/3m0s

running (0m24.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  13% ] 50 VUs  0m24.0s/3m0s

running (0m25.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  14% ] 50 VUs  0m25.0s/3m0s

running (0m26.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  14% ] 50 VUs  0m26.0s/3m0s

running (0m27.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  15% ] 50 VUs  0m27.0s/3m0s

running (0m28.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  16% ] 50 VUs  0m28.0s/3m0s

running (0m29.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  16% ] 50 VUs  0m29.0s/3m0s

running (0m30.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  17% ] 50 VUs  0m30.0s/3m0s

running (0m31.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
stress   [  17% ] 50 VUs  0m31.0s/3m0s

running (0m32.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  18% ] 50 VUs  0m32.0s/3m0s

running (0m33.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  18% ] 50 VUs  0m33.0s/3m0s

running (0m34.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  19% ] 50 VUs  0m34.0s/3m0s

running (0m35.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  19% ] 50 VUs  0m35.0s/3m0s

running (0m36.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  20% ] 50 VUs  0m36.0s/3m0s

running (0m37.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  21% ] 50 VUs  0m37.0s/3m0s

running (0m38.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  21% ] 50 VUs  0m38.0s/3m0s

running (0m39.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  22% ] 50 VUs  0m39.0s/3m0s

running (0m40.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  22% ] 50 VUs  0m40.0s/3m0s

running (0m41.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  23% ] 50 VUs  0m41.0s/3m0s

running (0m42.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  23% ] 50 VUs  0m42.0s/3m0s

running (0m43.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  24% ] 50 VUs  0m43.0s/3m0s

running (0m44.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  24% ] 50 VUs  0m44.0s/3m0s

running (0m45.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  25% ] 50 VUs  0m45.0s/3m0s

running (0m46.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  26% ] 50 VUs  0m46.0s/3m0s

running (0m47.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  26% ] 50 VUs  0m47.0s/3m0s

running (0m48.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  27% ] 50 VUs  0m48.0s/3m0s

running (0m49.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  27% ] 50 VUs  0m49.0s/3m0s

running (0m50.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  28% ] 50 VUs  0m50.0s/3m0s

running (0m51.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  28% ] 50 VUs  0m51.0s/3m0s

running (0m52.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  29% ] 50 VUs  0m52.0s/3m0s

running (0m53.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  29% ] 50 VUs  0m53.0s/3m0s

running (0m54.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  30% ] 50 VUs  0m54.0s/3m0s

running (0m55.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  31% ] 50 VUs  0m55.0s/3m0s

running (0m56.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  31% ] 50 VUs  0m56.0s/3m0s

running (0m57.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  32% ] 50 VUs  0m57.0s/3m0s

running (0m58.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  32% ] 50 VUs  0m58.0s/3m0s

running (0m59.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  33% ] 50 VUs  0m59.0s/3m0s

running (1m00.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  33% ] 50 VUs  1m00.0s/3m0s

running (1m01.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  34% ] 50 VUs  1m01.0s/3m0s

running (1m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  34% ] 50 VUs  1m02.0s/3m0s

running (1m03.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  35% ] 50 VUs  1m03.0s/3m0s

running (1m04.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  36% ] 50 VUs  1m04.0s/3m0s

running (1m05.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  36% ] 50 VUs  1m05.0s/3m0s

running (1m06.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  37% ] 50 VUs  1m06.0s/3m0s

running (1m07.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  37% ] 50 VUs  1m07.0s/3m0s

running (1m08.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  38% ] 50 VUs  1m08.0s/3m0s

running (1m09.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  38% ] 50 VUs  1m09.0s/3m0s

running (1m10.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  39% ] 50 VUs  1m10.0s/3m0s

running (1m11.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  39% ] 50 VUs  1m11.0s/3m0s

running (1m12.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  40% ] 50 VUs  1m12.0s/3m0s

running (1m13.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  41% ] 50 VUs  1m13.0s/3m0s

running (1m14.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  41% ] 50 VUs  1m14.0s/3m0s

running (1m15.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  42% ] 50 VUs  1m15.0s/3m0s

running (1m16.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  42% ] 50 VUs  1m16.0s/3m0s

running (1m17.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  43% ] 50 VUs  1m17.0s/3m0s

running (1m18.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  43% ] 50 VUs  1m18.0s/3m0s

running (1m19.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  44% ] 50 VUs  1m19.0s/3m0s

running (1m20.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  44% ] 50 VUs  1m20.0s/3m0s

running (1m21.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  45% ] 50 VUs  1m21.0s/3m0s

running (1m22.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  46% ] 50 VUs  1m22.0s/3m0s

running (1m23.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  46% ] 50 VUs  1m23.0s/3m0s

running (1m24.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  47% ] 50 VUs  1m24.0s/3m0s

running (1m25.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  47% ] 50 VUs  1m25.0s/3m0s

running (1m26.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  48% ] 50 VUs  1m26.0s/3m0s

running (1m27.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  48% ] 50 VUs  1m27.0s/3m0s

running (1m28.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  49% ] 50 VUs  1m28.0s/3m0s

running (1m29.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  49% ] 50 VUs  1m29.0s/3m0s

running (1m30.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  50% ] 50 VUs  1m30.0s/3m0s

running (1m31.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  51% ] 50 VUs  1m31.0s/3m0s

running (1m32.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  51% ] 50 VUs  1m32.0s/3m0s

running (1m33.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  52% ] 50 VUs  1m33.0s/3m0s

running (1m34.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  52% ] 50 VUs  1m34.0s/3m0s

running (1m35.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  53% ] 50 VUs  1m35.0s/3m0s

running (1m36.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  53% ] 50 VUs  1m36.0s/3m0s

running (1m37.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  54% ] 50 VUs  1m37.0s/3m0s

running (1m38.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  54% ] 50 VUs  1m38.0s/3m0s

running (1m39.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  55% ] 50 VUs  1m39.0s/3m0s

running (1m40.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  56% ] 50 VUs  1m40.0s/3m0s

running (1m41.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  56% ] 50 VUs  1m41.0s/3m0s

running (1m42.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  57% ] 50 VUs  1m42.0s/3m0s

running (1m43.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  57% ] 50 VUs  1m43.0s/3m0s

running (1m44.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  58% ] 50 VUs  1m44.0s/3m0s

running (1m45.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  58% ] 50 VUs  1m45.0s/3m0s

running (1m46.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  59% ] 50 VUs  1m46.0s/3m0s

running (1m47.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  59% ] 50 VUs  1m47.0s/3m0s

running (1m48.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  60% ] 50 VUs  1m48.0s/3m0s

running (1m49.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  61% ] 50 VUs  1m49.0s/3m0s

running (1m50.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  61% ] 50 VUs  1m50.0s/3m0s

running (1m51.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  62% ] 50 VUs  1m51.0s/3m0s

running (1m52.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  62% ] 50 VUs  1m52.0s/3m0s

running (1m53.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  63% ] 50 VUs  1m53.0s/3m0s

running (1m54.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  63% ] 50 VUs  1m54.0s/3m0s

running (1m55.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  64% ] 50 VUs  1m55.0s/3m0s

running (1m56.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  64% ] 50 VUs  1m56.0s/3m0s

running (1m57.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  65% ] 50 VUs  1m57.0s/3m0s

running (1m58.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  66% ] 50 VUs  1m58.0s/3m0s

running (1m59.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  66% ] 50 VUs  1m59.0s/3m0s

running (2m00.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  67% ] 50 VUs  2m00.0s/3m0s

running (2m01.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  67% ] 50 VUs  2m01.0s/3m0s

running (2m02.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  68% ] 50 VUs  2m02.0s/3m0s

running (2m03.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  68% ] 50 VUs  2m03.0s/3m0s

running (2m04.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
stress   [  69% ] 50 VUs  2m04.0s/3m0s

running (2m05.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  69% ] 50 VUs  2m05.0s/3m0s

running (2m06.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  70% ] 50 VUs  2m06.0s/3m0s

running (2m07.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  71% ] 50 VUs  2m07.0s/3m0s

running (2m08.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  71% ] 50 VUs  2m08.0s/3m0s

running (2m09.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  72% ] 50 VUs  2m09.0s/3m0s

running (2m10.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  72% ] 50 VUs  2m10.0s/3m0s

running (2m11.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  73% ] 50 VUs  2m11.0s/3m0s

running (2m12.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  73% ] 50 VUs  2m12.0s/3m0s

running (2m13.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  74% ] 50 VUs  2m13.0s/3m0s

running (2m14.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  74% ] 50 VUs  2m14.0s/3m0s

running (2m15.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  75% ] 50 VUs  2m15.0s/3m0s

running (2m16.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  76% ] 50 VUs  2m16.0s/3m0s

running (2m17.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  76% ] 50 VUs  2m17.0s/3m0s

running (2m18.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  77% ] 50 VUs  2m18.0s/3m0s

running (2m19.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  77% ] 50 VUs  2m19.0s/3m0s

running (2m20.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  78% ] 50 VUs  2m20.0s/3m0s

running (2m21.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  78% ] 50 VUs  2m21.0s/3m0s

running (2m22.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  79% ] 50 VUs  2m22.0s/3m0s

running (2m23.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  79% ] 50 VUs  2m23.0s/3m0s

running (2m23.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  79% ] 50 VUs  2m23.0s/3m0s

running (2m24.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  80% ] 50 VUs  2m24.0s/3m0s

running (2m25.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  81% ] 50 VUs  2m25.0s/3m0s

running (2m26.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  81% ] 50 VUs  2m26.0s/3m0s

running (2m27.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  82% ] 50 VUs  2m27.0s/3m0s

running (2m28.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  82% ] 50 VUs  2m28.0s/3m0s

running (2m29.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  83% ] 50 VUs  2m29.0s/3m0s

running (2m30.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  83% ] 50 VUs  2m30.0s/3m0s

running (2m31.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  84% ] 50 VUs  2m31.0s/3m0s

running (2m32.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  84% ] 50 VUs  2m32.0s/3m0s

running (2m33.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  85% ] 50 VUs  2m33.0s/3m0s

running (2m34.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  86% ] 50 VUs  2m34.0s/3m0s

running (2m35.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
stress   [  86% ] 50 VUs  2m35.0s/3m0s

running (2m36.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  87% ] 50 VUs  2m36.0s/3m0s

running (2m37.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  87% ] 50 VUs  2m37.0s/3m0s

running (2m38.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  88% ] 50 VUs  2m38.0s/3m0s

running (2m39.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  88% ] 50 VUs  2m39.0s/3m0s

running (2m40.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  89% ] 50 VUs  2m40.0s/3m0s

running (2m41.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  89% ] 50 VUs  2m41.0s/3m0s

running (2m42.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  90% ] 50 VUs  2m42.0s/3m0s

running (2m43.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  91% ] 50 VUs  2m43.0s/3m0s

running (2m44.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  91% ] 50 VUs  2m44.0s/3m0s

running (2m45.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  92% ] 50 VUs  2m45.0s/3m0s

running (2m46.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  92% ] 50 VUs  2m46.0s/3m0s

running (2m47.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  93% ] 50 VUs  2m47.0s/3m0s

running (2m48.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  93% ] 50 VUs  2m48.0s/3m0s

running (2m49.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  94% ] 50 VUs  2m49.0s/3m0s

running (2m50.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  94% ] 50 VUs  2m50.0s/3m0s

running (2m51.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  95% ] 50 VUs  2m51.0s/3m0s

running (2m52.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  96% ] 50 VUs  2m52.0s/3m0s

running (2m53.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  96% ] 50 VUs  2m53.0s/3m0s

running (2m54.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  97% ] 50 VUs  2m54.0s/3m0s

running (2m55.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  97% ] 50 VUs  2m55.0s/3m0s

running (2m56.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  98% ] 50 VUs  2m56.0s/3m0s

running (2m57.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  98% ] 50 VUs  2m57.0s/3m0s

running (2m58.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  99% ] 50 VUs  2m58.0s/3m0s

running (2m59.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [  99% ] 50 VUs  2m59.0s/3m0s

running (3m00.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress   [ 100% ] 50 VUs  3m00.0s/3m0s

running (3m01.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m02.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m03.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m04.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m05.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m06.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m07.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m08.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m09.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m10.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m11.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m12.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m13.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m14.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m15.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m16.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m17.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m18.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m19.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m20.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m21.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m22.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m23.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m24.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m25.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m26.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m27.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m28.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m29.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s

running (3m30.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
stress ↓ [ 100% ] 50 VUs  3m0s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.95' rate=6.31%

    http_req_failed
    ✗ 'rate<0.2' rate=93.68%

    indexing_ready_rate
    ✓ 'rate>0.8' rate=0.00%

    upload_accepted_rate
    ✗ 'rate>0.95' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 285    1.357133/s
    checks_succeeded...: 6.31%  18 out of 285
    checks_failed......: 93.68% 267 out of 285

    ✗ login success
      ↳  6% — ✓ 15 / ✗ 225
    ✗ documents success
      ↳  20% — ✓ 3 / ✗ 12
    ✗ upload accepted
      ↳  0% — ✓ 0 / ✗ 30

    CUSTOM
    indexing_ready_rate............: 0.00%  0 out of 0
    upload_accepted_rate...........: 0.00%  0 out of 30

    HTTP
    http_req_duration..............: avg=31.67s min=796.51ms med=30s   max=1m0s   p(90)=59.99s p(95)=1m0s  
      { expected_response:true }...: avg=5.94s  min=796.51ms med=1.17s max=29.99s p(90)=29.94s p(95)=29.97s
    http_req_failed................: 93.68% 267 out of 285
    http_reqs......................: 285    1.357133/s

    EXECUTION
    iteration_duration.............: avg=31.04s min=31s      med=31s   max=31.25s p(90)=31.16s p(95)=31.2s 
    iterations.....................: 225    1.07142/s
    vus............................: 15     min=15         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 122 kB 579 B/s
    data_sent......................: 5.0 MB 24 kB/s



running (3m30.0s), 00/50 VUs, 225 complete and 15 interrupted iterations
stress ✓ [ 100% ] 50 VUs  3m0s